cmattatall/adcs_firmware/drivers/extern/msp430_driverlib_2_91_13_01/driverlib/MSP430i2xx/sd24.h
//*****************************************************************************
//
//! \brief Clears interrupts for the SD24 Module
//!
//! This function clears interrupt flags for the SD24 module.
//!
//! \param baseAddress is the base address of the SD24 module.
//! \param converter is the selected converter.
//!        Valid values are:
//!        - \b SD24_CONVERTER_0
//!        - \b SD24_CONVERTER_1
//!        - \b SD24_CONVERTER_2
//!        - \b SD24_CONVERTER_3
//! \param mask is the bit mask of the converter interrupt sources to clear.
//!        Mask value is the logical OR of any of the following:
//!        - \b SD24_CONVERTER_INTERRUPT
//!        - \b SD24_CONVERTER_OVERFLOW_INTERRUPT
//!        \n Modified bits are \b SD24OVIFGx of \b SD24BIFG register.
//!
//! \return None
//
//*****************************************************************************
extern void SD24_clearInterrupt(uint16_t baseAddress,
                                uint8_t converter,
                                uint16_t mask);

//*****************************************************************************
//
//! \brief Returns the interrupt status for the SD24 Module
//!
//! This function returns interrupt flag statuses for the SD24 module.
//!
//! \param baseAddress is the base address of the SD24 module.
//! \param converter is the selected converter.
//!        Valid values are:
//!        - \b SD24_CONVERTER_0
//!        - \b SD24_CONVERTER_1
//!        - \b SD24_CONVERTER_2
//!        - \b SD24_CONVERTER_3
//! \param mask is the bit mask of the converter interrupt sources to return.
//!        Mask value is the logical OR of any of the following:
//!        - \b SD24_CONVERTER_INTERRUPT
//!        - \b SD24_CONVERTER_OVERFLOW_INTERRUPT
//!
//! \return Logical OR of any of the following:
//!         - \b SD24_CONVERTER_INTERRUPT
//!         - \b SD24_CONVERTER_OVERFLOW_INTERRUPT
//!         \n indicating the status of the masked interrupts
//
//*****************************************************************************
extern uint16_t SD24_getInterruptStatus(uint16_t baseAddress,
                                        uint8_t converter,
                                        uint16_t mask);

//*****************************************************************************
//
// Mark the end of the C bindings section for C++ compilers.
//
//*****************************************************************************
#ifdef __cplusplus
}
#endif

#endif
#endif // __MSP430WARE_SD24_H__
